In [ ]:
# For some reason, MySQLWorkbench took 40 mins to load a csv file and didn't work in the end.
# Solution, I can do everything in Python

In [ ]:
# Modules imported
import pandas as pd
import numpy as np
import matplotlib as plt

In [ ]:
data = pd.read_csv('/Users/paxton615/Downloads/UserBehavior.csv')

In [ ]:
data.shape

In [ ]:
data.head()

In [ ]:
data.isnull().sum()

In [ ]:
data.nunique()

In [ ]:
# col names = ['user_id', 'item_id','category_id','status',"timestamp"]
# pv: page view, buy: buy, cart: cart:, fav:favorite
data.columns = ['user_id', 'item_id','category_id','status',"timestamp"]

In [ ]:
fun = data.head()
fun

In [ ]:
str(pd.Timestamp(fun['timestamp'][0], unit='s'))[:10]

In [ ]:
# str to timestamp
str(pd.Timestamp('2017-11-11').year)+'-'+str(pd.Timestamp('2017-11-11').month)

In [ ]:
pd.Timestamp(fun['timestamp'][0], unit='s').hour

In [ ]:
pd.Timestamp(fun['timestamp'][0], unit='s').month

In [ ]:
# select 3 million for analysis, calling them 'users'
users = data.iloc[5000000:8000000,:]

In [ ]:
# saving partial data as a new csv file safe time for future restart kernel
# This step might be done multiple times!!!

In [ ]:
users.shape

In [ ]:
users.reset_index(drop=True, inplace=True)

In [ ]:
users.head()

In [ ]:
users.nunique()

In [ ]:
total_nuni = ['1 987994','2268318 4162024','2520377 9439','pv 4','1511544070 815859']

In [ ]:
int(total_nuni[0].split(' ')[1])

In [ ]:
denominator = [int(i.split(' ')[1]) for i in total_nuni]
denominator

In [ ]:
numerator = [i for i in users.nunique()]
numerator

In [ ]:
perct = []
for i,j in zip(numerator,denominator):
    perct.append(i/j)

In [ ]:
        # the subset, users, contains 3% of total users,
perct   # 19% of total items, 73% of categories

In [ ]:
users['hour']=[pd.Timestamp(i, unit='s').hour for i in users.timestamp]

In [ ]:
users['year']=[pd.Timestamp(i, unit='s').year for i in users.timestamp]

In [ ]:
users['day']=[pd.Timestamp(i, unit='s').day for i in users.timestamp]

In [ ]:
users['month']=[pd.Timestamp(i, unit='s').month for i in users.timestamp]

In [ ]:
users.year.unique() # data were generated during 2017-11-25 to 2017-12-3
# 2020,1919,2021 need to be found and cleaned later!

In [ ]:
users[(users['year']==1919)| (users['year']==2021)|(users['year']==2020)].count()

In [ ]:
users = users[users['year']==2017]

In [ ]:
users.head()

In [ ]:
np.sort(users.hour.unique()) # hours seem normal

In [ ]:
users.day.unique()

In [ ]:
users.groupby('day').count() # 11.25-12.3
# the rest of days need to be cleaned

In [ ]:
users = users[users['day'].isin([25,26,27,28,29,30,1,2,3])]

In [ ]:
users.month.unique()
# data happened during 2017.11-2017.12, some months need to be cleaned

In [ ]:
users[(users['month']==10)| (users['month']==4)|(users['month']==9)|(users['month']==5)|(users['month']==8)].count()

In [ ]:
users = users[users['month'].isin([11,12])]

In [ ]:
users.shape

In [ ]:
users.head()

In [ ]:
users.to_csv(r'/Users/paxton615/Github_Personal/Alibaba_UserBehavior_Analysis/drafts/users_3m.csv')

# It's time to save a csv file as backup

# Later, just begin from here

In [1]:
# Modules imported
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
users = pd.read_csv('/Users/paxton615/Github_Personal/Alibaba_UserBehavior_Analysis/drafts/users_3m.csv')

In [3]:
users.head()

,Unnamed: 0,user_id,item_id,category_id,status,timestamp,hour,year,day,month
0,0,309818,4710383,1792277,pv,1511959603,12,2017,29,11
1,1,309818,1421743,4069500,pv,1511959759,12,2017,29,11
2,2,309818,800137,1216617,pv,1511959828,12,2017,29,11
3,3,309818,2493122,1216617,pv,1511959953,12,2017,29,11
4,4,309818,1461532,3102419,pv,1511998449,23,2017,29,11

In [4]:
#因为其后发现时区问题，这里返回纠正，加上时区后更新月，天，时的数据

In [5]:
pd.Timestamp(1511959603, unit='s',tz='Asia/Shanghai')

Timestamp('2017-11-29 20:46:43+0800', tz='Asia/Shanghai')

In [6]:
pd.Timestamp(1511959603, unit='s')

Timestamp('2017-11-29 12:46:43')

In [8]:
users['hour']=[pd.Timestamp(i, unit='s',tz='Asia/Shanghai').hour for i in users.timestamp]

In [9]:
users['day']=[pd.Timestamp(i, unit='s',tz='Asia/Shanghai').day for i in users.timestamp]

In [10]:
users['month']=[pd.Timestamp(i, unit='s',tz='Asia/Shanghai').month for i in users.timestamp]

In [11]:
users.head()

,Unnamed: 0,user_id,item_id,category_id,status,timestamp,hour,year,day,month
0,0,309818,4710383,1792277,pv,1511959603,20,2017,29,11
1,1,309818,1421743,4069500,pv,1511959759,20,2017,29,11
2,2,309818,800137,1216617,pv,1511959828,20,2017,29,11
3,3,309818,2493122,1216617,pv,1511959953,20,2017,29,11
4,4,309818,1461532,3102419,pv,1511998449,7,2017,30,11

In [12]:
users.shape

(2962671, 10)

In [13]:
# drop Unnamed: 0 col
users.drop('Unnamed: 0',axis=1,inplace=True)

In [14]:
# dropduplicstes: same user,same day, same hour, viewed the same item 
users = users.drop_duplicates(subset=['user_id','item_id','status','hour','day'])

In [15]:
users.shape

(2716044, 9)

In [16]:
# Form user['date'] by using year, month, day
date = []
for i,j,k in zip(users['year'], users['month'], users['day']):
    date.append(str(i)+"-"+str(j)+"-"+str(k))

In [17]:
users['date']=pd.to_datetime(date)

In [18]:
users.head()

,user_id,item_id,category_id,status,timestamp,hour,year,day,month,date
0,309818,4710383,1792277,pv,1511959603,20,2017,29,11,2017-11-29
1,309818,1421743,4069500,pv,1511959759,20,2017,29,11,2017-11-29
2,309818,800137,1216617,pv,1511959828,20,2017,29,11,2017-11-29
3,309818,2493122,1216617,pv,1511959953,20,2017,29,11,2017-11-29
4,309818,1461532,3102419,pv,1511998449,7,2017,30,11,2017-11-30

In [20]:
# Add dayofweek to the party, think it can be intuitively useful later
users['dayofweek']=[pd.Timestamp(i, unit='s',tz='Asia/Shanghai').dayofweek for i in users.timestamp]

In [21]:
users.dayofweek.unique()

array([2, 3, 4, 5, 6, 0, 1])

In [22]:
# tidy cols and reset_index
users = users[['user_id', 'item_id' , 'category_id', 'status', 'date','dayofweek' ,'hour']]
users.reset_index(drop=True, inplace=True)

In [23]:
users.dtypes
# Could convert hour to datetime as well, however, don't see the need yet
# pd.to_datetime(users['hour'], format='%H')

user_id                 int64
item_id                 int64
category_id             int64
status                 object
date           datetime64[ns]
dayofweek               int64
hour                    int64
dtype: object

       Tried only keep hour as datetime, haven't gotten lucky
import datetime
from datetime import datetime
from datetime import time

hr=[]
for i in users['hour']:
    hr.append(time(i).strftime('%H'))

users['hr']=[time(i).strftime('%H') for i in users['hour']]

users.hr = pd.to_datetime(users.hr, format='%H')

users.dtypes

users['hr']=users.hr.dt.hour

users.head()

users.dtypes

users['hr']= [datetime.strptime(str(i), '%H') for i in users['hr']]

In [26]:
users.head()

   user_id  item_id  category_id status       date  dayofweek  hour
0   309818  4710383      1792277     pv 2017-11-29          2    20
1   309818  1421743      4069500     pv 2017-11-29          2    20
2   309818   800137      1216617     pv 2017-11-29          2    20
3   309818  2493122      1216617     pv 2017-11-29          2    20
4   309818  1461532      3102419     pv 2017-11-30          3     7

In [32]:
# 0为周一，6为周天
users.groupby(['date','dayofweek'])[['user_id']].agg(['count'])

                     user_id
                       count
date       dayofweek
2017-11-25 5          257982
2017-11-26 6          293985
2017-11-27 0          278464
2017-11-28 1          273933
2017-11-29 2          279356
2017-11-30 3          284730
2017-12-01 4          298508
2017-12-02 5          378154
2017-12-03 6          370909
2017-12-04 0              23

In [33]:
# Adventurous guess: people love to online shop on the weekend

In [34]:
# Count each day's users' status 
#users.groupby(['date','dayofweek','status'])[['user_id']].agg(['count'])

In [35]:
users.to_csv(r'/Users/paxton615/Github_Personal/Alibaba_UserBehavior_Analysis/drafts/users_2m.csv')

# Saved another version, contain 2.7m entries, dayofweek col within.

In [1]:
# Modules imported
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
users = pd.read_csv('/Users/paxton615/Github_Personal/Alibaba_UserBehavior_Analysis/drafts/users_2m.csv')

In [3]:
users.head()

,Unnamed: 0,user_id,item_id,category_id,status,date,dayofweek,hour
0,0,309818,4710383,1792277,pv,2017-11-29,2,20
1,1,309818,1421743,4069500,pv,2017-11-29,2,20
2,2,309818,800137,1216617,pv,2017-11-29,2,20
3,3,309818,2493122,1216617,pv,2017-11-29,2,20
4,4,309818,1461532,3102419,pv,2017-11-30,3,7

In [4]:
users.drop('Unnamed: 0', axis=1, inplace=True)

In [5]:
users.head()

   user_id  item_id  category_id status        date  dayofweek  hour
0   309818  4710383      1792277     pv  2017-11-29          2    20
1   309818  1421743      4069500     pv  2017-11-29          2    20
2   309818   800137      1216617     pv  2017-11-29          2    20
3   309818  2493122      1216617     pv  2017-11-29          2    20
4   309818  1461532      3102419     pv  2017-11-30          3     7

# 用户使用行为的漏斗模型

分析用户使用行为的漏斗模型，AARRR模型分析用户行为，此处数据主要涉及用户刺激和购买转化环节。
通过用户从浏览到最终购买过程的流失情况，包括浏览，收藏，加入购物车和购买。在本例中，各项指标如下:

In [41]:
# 访问用户总数 （UV）:29233
users.nunique()

user_id         29233
item_id        799972
category_id      6900
status              4
date               10
dayofweek           7
hour               24
dtype: int64

In [42]:
# 页面总访问量 （PV）：2406344
users.groupby('status')['user_id'].count()

status
buy       58039
cart     166181
fav       85480
pv      2406344
Name: user_id, dtype: int64

平均每人每周访问量

In [43]:
# Average PV per week per person
avg_pv = users.groupby('status')['user_id'].count().pv / users.user_id.nunique()
'{:.4}'.format(avg_pv)

'82.32'

跳失率：只点击一次浏览的用户数量/总用户访问量

user_stat_cnts0 = pd.DataFrame(users.groupby(['user_id','status'])['status'].count())

user_stat_cnts0.head()

user_stat_cnts0.loc[42,'pv']

user_stat_cnts1=user_stat_cnts0.reset_index(level=0)

user_stat_cnts1.head()

In [44]:
# 每个用户的pv数量是多少？逻辑：相当于通过按user_id来groupby，统计大类（status）中某个小类（pv）的数量
# 很重要的groupby应用实例，filter之后再做groupby
# 很重要，很重要
user_pv = pd.DataFrame(users[users['status']=='pv'].groupby(users['user_id'])['status'].count())
user_pv.columns=['pv']
user_pv.head()

          pv
user_id
34        32
42        50
43       119
310       69
311       34

In [45]:
# 只有一次浏览记录的用户有多少？
# 可见，非常少，可以忽略不计。
len(user_pv[user_pv['pv'] == 1])

23

In [46]:
# 所有user的总浏览量
users[users['status']=='pv']['user_id'].count()

2406344

In [47]:
# 跳失率
Bounce_rate = len(user_pv[user_pv['pv'] == 1]) / users[users['status']=='pv']['user_id'].count()

'{:.6%}'.format(Bounce_rate)

'0.000956%'

漏斗模型：
喜欢和放入购物车都属于决策环节，二者合一。
百分之多少的人从pv进入了cart和fav环节
又有百分之多少的人从cart和fav环节进入了最后的buy

In [48]:
users_status = users.groupby('status').user_id.count()
users_status

status
buy       58039
cart     166181
fav       85480
pv      2406344
Name: user_id, dtype: int64

In [49]:
# 约10.46%的用户从浏览环节进入决策环节
pv_to_cartnfav = (users_status[1]+users_status[2])/users_status[3]

'{:2%}'.format(pv_to_cartnfav)

'10.458230%'

In [50]:
# 约23.06%的用户从决策环节进入了购买环节，环比之前大幅提升
cartnfav_to_buy = users_status[0]/(users_status[1]+users_status[2])
'{:2%}'.format(cartnfav_to_buy)

'23.062374%'

# 不同时间尺度下，用户行为模式分析

1.分析一周内的用户使用情况

In [51]:
users.date.unique()

array(['2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
       '2017-12-03', '2017-11-27', '2017-11-28', '2017-11-25',
       '2017-11-26', '2017-12-04'], dtype=object)

In [52]:
# ub is user behavior
ub_daily_old=pd.DataFrame(users.groupby(['date','status'], as_index=False).user_id.count())
ub_daily_old.head()

         date status  user_id
0  2017-11-25    buy     5370
1  2017-11-25   cart    15233
2  2017-11-25    fav     8090
3  2017-11-25     pv   229289
4  2017-11-26    buy     5995

In [53]:
# .pivot() 以...为中心旋转 很重要很重要很重要
ub_daily = ub_daily_old.pivot(index='date',columns='status')
ub_daily

           user_id
status         buy     cart      fav        pv
date
2017-11-25  5370.0  15233.0   8090.0  229289.0
2017-11-26  5995.0  18057.0   9245.0  260688.0
2017-11-27  6566.0  16564.0   8817.0  246517.0
2017-11-28  6055.0  16468.0   8639.0  242771.0
2017-11-29  6299.0  16771.0   8885.0  247401.0
2017-11-30  6458.0  17192.0   9177.0  251903.0
2017-12-01  6137.0  18759.0   9088.0  264524.0
2017-12-02  7707.0  23909.0  12058.0  334480.0
2017-12-03  7452.0  23228.0  11481.0  328748.0
2017-12-04     NaN      NaN      NaN      23.0

In [54]:
# 好像可以对multi_colums的col name直接做修改
ub_daily.columns = ['buy', 'cart', 'fav', 'pv']

In [55]:
# 改名后调整cols的顺序
ub_daily = ub_daily[['pv','fav','cart','buy']]
ub_daily

                  pv      fav     cart     buy
date
2017-11-25  229289.0   8090.0  15233.0  5370.0
2017-11-26  260688.0   9245.0  18057.0  5995.0
2017-11-27  246517.0   8817.0  16564.0  6566.0
2017-11-28  242771.0   8639.0  16468.0  6055.0
2017-11-29  247401.0   8885.0  16771.0  6299.0
2017-11-30  251903.0   9177.0  17192.0  6458.0
2017-12-01  264524.0   9088.0  18759.0  6137.0
2017-12-02  334480.0  12058.0  23909.0  7707.0
2017-12-03  328748.0  11481.0  23228.0  7452.0
2017-12-04      23.0      NaN      NaN     NaN

小结论：
11-29为周三，11-25为周六，12-03为周日
周一到周五数据趋于稳定，周末数据有明显增加，运营活动可向周末时间倾斜

2. 分析用户一天内的使用情况

In [56]:
users.head()

   user_id  item_id  category_id status        date  dayofweek  hour
0   309818  4710383      1792277     pv  2017-11-29          2    20
1   309818  1421743      4069500     pv  2017-11-29          2    20
2   309818   800137      1216617     pv  2017-11-29          2    20
3   309818  2493122      1216617     pv  2017-11-29          2    20
4   309818  1461532      3102419     pv  2017-11-30          3     7

In [74]:
nov_28 = users[users['date']=='2017-11-29'][['user_id','status','hour']]

In [75]:
nov_28.head()

    user_id status  hour
0    309818     pv    20
1    309818     pv    20
2    309818     pv    20
3    309818     pv    20
74   309824     pv     9

In [76]:
temp = nov_28.groupby(['hour','status'],as_index=False).count()

In [77]:
temp.head()

   hour status  user_id
0     0    buy      122
1     0   cart      448
2     0    fav      297
3     0     pv     7743
4     1    buy       49

In [103]:
nov_28 = temp.pivot(index='hour',columns='status')

In [104]:
nov_28.head()

       user_id
status     buy cart  fav    pv
hour
0          122  448  297  7743
1           49  235  114  3469
2           28  125   62  1969
3           30   86   83  1461
4           20   79   47  1291

In [105]:
nov_28.columns=['buy', 'cart', 'fav', 'pv']

In [121]:
nov_28 = nov_28[['pv','fav','cart','buy']]
nov_28.head()

        pv  fav  cart  buy
hour
0     7743  297   448  122
1     3469  114   235   49
2     1969   62   125   28
3     1461   83    86   30
4     1291   47    79   20

# 此处发现一个大问题，11-28号，简书的案例中显示21，22点是用户最活跃的时间，而我的timestamp读取出的时间是13，14点！！！需返回后重新检查... ... (已返回，且问题已通过加入上海时区而解决)

In [111]:
# 设计一个function，将制定数据自动转换成某日的四种状态浏览记录
def daily_status(df,str_colname1,str_colname2,str_colname3):
    temp = df.groupby([str_colname3,str_colname2],as_index=False).count()
    daily_num = temp.pivot(index=str_colname3,columns=str_colname2)
    daily_num.columns=['buy', 'cart', 'fav', 'pv']
    daily_num = daily_num[['pv','fav','cart','buy']]
    return (daily_num)

In [112]:
nov_29=users[users['date']=='2017-11-29'][['user_id','status','hour']]

In [122]:
daily_status(nov_29,'user_id','status','hour').sort_values('pv',ascending=False).head(7)

         pv  fav  cart  buy
hour
21    20731  682  1471  521
22    20477  735  1506  419
20    17662  513  1169  392
19    15312  437  1053  376
23    14911  660  1068  297
13    13962  504   945  454
14    13275  494   884  354

In [119]:
# "2017-12-02" correct ; "2017-12-2" incorrect
dec_2=users[users['date']=='2017-12-02'][['user_id','status','hour']]

In [123]:
daily_status(dec_2,'user_id','status','hour').sort_values('pv',ascending=False).head(7)

         pv  fav  cart  buy
hour
21    28747  912  2151  560
22    27787  952  2033  539
20    25508  889  1758  535
23    23263  860  1807  390
19    21023  726  1417  428
16    17680  599  1218  475
15    17368  562  1210  466

小结论：从每天的数据情况来看，20-23是绝对使用高峰期，应该在此时间段内增加互动营销，以希望更大收益

# 不同商品种类的用户行为

1. 统计浏览次数，购买次数，收藏次数，和加入购物车次数最多的商品

In [125]:
users.head()

   user_id  item_id  category_id status        date  dayofweek  hour
0   309818  4710383      1792277     pv  2017-11-29          2    20
1   309818  1421743      4069500     pv  2017-11-29          2    20
2   309818   800137      1216617     pv  2017-11-29          2    20
3   309818  2493122      1216617     pv  2017-11-29          2    20
4   309818  1461532      3102419     pv  2017-11-30          3     7

In [139]:
# top item been seen
users[users['status']=='pv'][['item_id','user_id']].groupby('item_id').count().sort_values('user_id',ascending=False).head()

         user_id
item_id
812879       812
3845720      628
2032668      592
2331370      556
138964       548

In [133]:
# top items been bought
users[users['status']=='buy'][['item_id','user_id']].groupby('item_id').count().sort_values('user_id',ascending=False).head(20)

         user_id
item_id
3122135       34
3031354       23
1910706       23
5140357       23
2964774       22
3189426       20
1813380       16
3251377       16
5062984       16
5051027       16
2560262       16
2101968       15
3237415       15
3964583       15
1116492       15
5067020       15
4024409       15
4443059       15
265985        14
2267309       14

In [134]:
# top items in fav
users[users['status']=='fav'][['item_id','user_id']].groupby('item_id').count().sort_values('user_id',ascending=False).head(20)

         user_id
item_id
2279428       34
2331370       29
812879        24
3330337       23
2032668       23
3031354       22
3845720       22
2364679       21
1535294       21
987143        21
138964        21
1783990       21
3920968       20
2648375       20
2818406       19
1419997       18
1583704       18
740947        17
2453685       17
1343119       16

In [135]:
# top items in cart
users[users['status']=='cart'][['item_id','user_id']].groupby('item_id').count().sort_values('user_id',ascending=False).head(20)

         user_id
item_id
3031354       46
812879        44
2818406       43
138964        41
2560262       37
2331370       36
1535294       36
2453685       33
3715112       31
3920968       30
2338453       30
4649427       30
2667139       29
3330337       29
1583704       29
1444258       28
4443059       28
2279428       28
3845720       27
4211339       27

In [ ]:
# 以上四幅图需要一个能有效结合在一起的方式，没有比较，几幅图的意义不大。
# 最好是图形的。

2. 统计所有商品的购买次数

In [141]:
users.head()

   user_id  item_id  category_id status        date  dayofweek  hour
0   309818  4710383      1792277     pv  2017-11-29          2    20
1   309818  1421743      4069500     pv  2017-11-29          2    20
2   309818   800137      1216617     pv  2017-11-29          2    20
3   309818  2493122      1216617     pv  2017-11-29          2    20
4   309818  1461532      3102419     pv  2017-11-30          3     7

In [142]:
users[users['status']=='buy'][['item_id','user_id']].head()

    item_id  user_id
5   3648099   309818
69  3254921   309824
72  1245023   309824
73  2992622   309824
91  3883578   309824

In [153]:
item_buytimes = users[users['status']=='buy'][['item_id','user_id']].groupby('item_id', as_index=False).count().sort_values('user_id',ascending=False)

In [154]:
item_buytimes.head()

       item_id  user_id
27685  3122135       34
26865  3031354       23
16847  1910706       23
45389  5140357       23
26227  2964774       22

In [165]:
# There are 38449 kinds of iterms that only been bought once
# only one item was bought 34 times
item_buytimes.groupby('user_id').count()

         item_id
user_id
1          38449
2           4796
3           1227
4            503
5            234
6            123
7             93
8             52
9             35
10            17
11            14
12            18
13             9
14             2
15             7
16             5
20             1
22             1
23             3
34             1

In [163]:
item_buytimes_stas = pd.DataFrame(item_buytimes.groupby('user_id').count())

In [177]:
'{:.2%}'.format(item_buytimes_stas.item_id[1]/sum(item_buytimes_stas.item_id))

'84.34%'

84.34%这个数据说明，大部分的销售来源于长尾商品的累积效应。而非爆款商品的带动。

# 基于RFM理论找出有价值的用户

In [6]:
users.head()

   user_id  item_id  category_id status        date  dayofweek  hour
0   309818  4710383      1792277     pv  2017-11-29          2    20
1   309818  1421743      4069500     pv  2017-11-29          2    20
2   309818   800137      1216617     pv  2017-11-29          2    20
3   309818  2493122      1216617     pv  2017-11-29          2    20
4   309818  1461532      3102419     pv  2017-11-30          3     7

In [12]:
len(users[users['status']=='buy'].groupby('user_id',as_index=False)['date'].agg(['max']))

19804

In [15]:
# the most recent shopping record of each user
recent_buy = users[users['status']=='buy'].groupby('user_id',as_index=False)['date'].agg(['max'])

In [16]:
recent_buy.head()

                max
user_id
43       2017-12-03
310      2017-12-01
311      2017-12-03
312      2017-12-03
318      2017-11-30

In [18]:
recent_buy.columns=['latest_shopping']
recent_buy.reset_index(inplace=True)

In [19]:
recent_buy.head()

   user_id latest_shopping
0       43      2017-12-03
1      310      2017-12-01
2      311      2017-12-03
3      312      2017-12-03
4      318      2017-11-30

In [24]:
np.sort(recent_buy.latest_shopping.unique())

array(['2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
       '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
       '2017-12-03'], dtype=object)

In [22]:
recent_buy['latest_shopping'][1]>'2017-11-02'

True

In [68]:
recent_buy['R'] = [0 if '2017-11-25'<= i <='2017-11-27' 
                   else 1 if '2017-11-28' <= i <= '2017-11-30' 
                   else 2 for i in recent_buy.latest_shopping]

In [69]:
recent_buy.head()

   user_id latest_shopping  R
0       43      2017-12-03  2
1      310      2017-12-01  2
2      311      2017-12-03  2
3      312      2017-12-03  2
4      318      2017-11-30  1

In [70]:
shopping_freq = users[users['status']=='buy'].groupby('user_id', as_index=False).item_id.count()

In [71]:
shopping_freq.head()

   user_id  item_id
0       43        6
1      310        1
2      311        9
3      312        8
4      318        2

In [72]:
shopping_freq[shopping_freq['user_id']==339189]

      user_id  item_id
5913   339189       33

In [73]:
shopping_freq.item_id.unique()

array([ 6,  1,  9,  8,  2,  3, 10,  5,  4,  7, 14, 17, 23, 16, 11, 12, 13,
       15, 39, 18, 20, 22, 27, 31, 25, 19, 92, 33, 35, 40, 24, 26, 21, 28,
       43, 30, 45, 36])

In [74]:
shopping_freq['F'] = [ 5 if i >= 50 
                     else 4 if 49 >= i >= 40
                     else 3 if 39 >= i >= 30
                     else 2 if 29 >= i >= 20
                     else 1 for i in shopping_freq.item_id]

In [75]:
shopping_freq.head()

   user_id  item_id  F
0       43        6  1
1      310        1  1
2      311        9  1
3      312        8  1
4      318        2  1

In [76]:
shopping_freq[shopping_freq['user_id']==337305]

      user_id  item_id  F
5662   337305       92  5

In [86]:
rfm = pd.merge(recent_buy, shopping_freq, on='user_id')[['user_id','latest_shopping','R','F']]

In [87]:
rfm['R+F'] = rfm['R']+rfm['F']

In [88]:
rfm.head()

   user_id latest_shopping  R  F  R+F
0       43      2017-12-03  2  1    3
1      310      2017-12-01  2  1    3
2      311      2017-12-03  2  1    3
3      312      2017-12-03  2  1    3
4      318      2017-11-30  1  1    2

In [89]:
rfm[rfm['user_id']==337305]

      user_id latest_shopping  R  F  R+F
5662   337305      2017-12-03  2  5    7

In [101]:
rfm['R+F'].value_counts(normalize=True)

3    0.580438
2    0.265855
1    0.151434
4    0.001717
5    0.000353
6    0.000151
7    0.000050
Name: R+F, dtype: float64

In [102]:
1.5/11.4

0.13157894736842105

In [103]:
7.2/22

0.32727272727272727